#+LATEX_HEADER: \newcommand{\Lame}{Lam\'{e}}
*** Example: Counting Change
How many different way can we make change of $1.00, given half-dollars, quarters, dimes, nickles, 
and pennies?
More generally, can we write a procedure to compute the number of ways to change any given amount
of money?

The problem has a simple solution as a recursive procedure.
Suppose we think of types of coins available as arranged in some order. Then the following relation holds:
The number of ways to change amount $a$ using $n$ kinds of coins equals
+ the number of ways to change amount $a$ using all but the first kind of coin, plus
+ the number of ways to change amount $a-d$ using all $n$ kinds of coins, where $d$ is the denomination of
  the first kind of coin. (force to use at least one of the first kind of coins in the solution)

To see why this is true, observe that the ways to make change can be divided into two groups:
those that do not use any of the first kind of coins, and those that do.

Thus we can recursively reduce the problem of changing a given amount to the problem of changing smaller
amounts using fewer kinds of coins. Consider this reduction rule carefully, and convince yourself that we
can use it to describe an algorithm if we specify the following degenerate cases:
1. If $a$ is exactly 0, we should count that as 1 way to make change
2. If $a$ is less than 0, we should count that as 0 ways to make change.
3. If $n$ is 0, we should count that as 0 ways to make change.
We can easily translate this into a recursive procedure
#+begin_src scheme
    (define (count-change amount)
      (cc amount 5))

    ;; assume that coins are sorted in some order
    ;; pennies      1
    ;; nickles      5
    ;; dimes        10
    ;; quarters     25
    ;; half-dollars 50
    (define (cc amount kinds-of-coins)
      (cond ((= amount 0) 1)
            ((< amount 0) 0)
            ((= kinds-of-coins 0) 0)
            (else (+ (cc amount ;; adding two groups of changing:
                         (- kinds-of-coins 1)) ;; 1. doesn't use the first kind
                     (cc (- amount
                            (first-denomination kinds-of-coins))
                         kinds-of-coins)))))   ;; 2. use at least one of it.

    (define (first-denomination kinds-of-coins)
      (cond ((= kinds-of-coins 1) 1)
            ((= kinds-of-coins 2) 5)
            ((= kinds-of-coins 3) 10)
            ((= kinds-of-coins 4) 25)
            ((= kinds-of-coins 5) 50)))

  (count-change 100)
#+end_src

#+RESULTS:
: 292

Here we are thinking of the coins as arranged in order from largest to smallest, but any order will do
as well.

This procedure generates a tree-recursive process with redundancies similar to the recursive version of ~fib~.
And it is not so obvious how to design a better algorithm for computing the result, and we leave that as a challenge.

*** Greatest Common Divisors
The greatest common divisor (GCD) of two integers $a$ and $b$ is defined to be the
largest integer that divides both $a$ and $b$ with no remainder. We will need a way
to compute GCD when we investigate how to implement rational number arithmetic in 
next chapter. (To reduce a rational number to lowest terms).

The idea of the Euclid's Algorithm is based on the observation that, if $r$ is the
remainder when $a$ is divided by $b$, then the common divisors of $a$ and $b$ are
precisely the same as the common divisors of $b$ and $r$. Thus, we can use the equation:

$$
GCD(a, b) = GCD(b, r)
$$

to successively reduce the problem of computing a GCD to the problem of computing the
GCD of smaller and smaller pairs of integers.

It is possible to show that starting with any two positive integers and performing 
repeated reductions will always eventually produce a pair where the second number is 0.
Then the GCD is the other number in the pair.

#+begin_src scheme
  (define (gcd a b)
    (if (= b 0)
        a
        (gcd b (remainder a b))))
(gcd 206 40)
#+end_src

#+RESULTS:
: 2

This generates an iterative process, whose number of steps grows as the logarithm
of the numbers involved.

The fact that the number of steps required by Euclid's Algorithm has logarithm growth
bears an interesting relation to the Fibonacci numbers:

- **\Lame Theorem** :: If Euclid's Algorithm requires $k$ steps to compute the GCD of
  some pair, then the smaller number in the pair must be greater than or equal to the $k$th
  Fibonacci number.

We can use this theorem to get an order-of growth estimate fro Euclid's Algorithm.
Let $n$ be the smaller of the two inputs to the procedure. If the process takes $k$
steps, then we must have $n \geq Fib(k) \approx \phi^k / \sqrt{5}$.
Notice that the relationship between $n$ and $k$, as $n$ grows, $k$ grow as the logarithm
(to the base $\phi$) of $n$, or less. Hence, the order of growth is $\Theta(\log{n})$.
